modules/srm-server/wsdl/managerv1.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<!--generated by GLUE on Mon Dec 16 11:13:39 CST 2002-->
<definitions name='SRMServerV1' targetNamespace='http://srm.1.0.ns' xmlns:tns='http://srm.1.0.ns' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:http='http://schemas.xmlsoap.org/wsdl/http/' xmlns:mime='http://schemas.xmlsoap.org/wsdl/mime/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soapenc='http://schemas.xmlsoap.org/soap/encoding/' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns='http://schemas.xmlsoap.org/wsdl/' xmlns:tme='http://www.themindelectric.com/' xmlns:ns11='http://www.themindelectric.com/package/diskCacheV111.srm/' xmlns:ns12='http://www.themindelectric.com/package/java.lang/' xmlns:ns13='http://www.themindelectric.com/package/'><types><schema xmlns='http://www.w3.org/2001/XMLSchema' targetNamespace='http://www.themindelectric.com/package/diskCacheV111.srm/'><complexType name='RequestStatus'><sequence><element name='requestId' type='int'/><element name='type' nillable='true' type='string'/><element name='state' nillable='true' type='string'/><element name='submitTime' nillable='true' type='dateTime'/><element name='startTime' nillable='true' type='dateTime'/><element name='finishTime' nillable='true' type='dateTime'/><element name='estTimeToStart' type='int'/><element name='fileStatuses' nillable='true' type='ns11:ArrayOfRequestFileStatus'/><element name='errorMessage' nillable='true' type='string'/><element name='retryDeltaTime' type='int'/></sequence></complexType><complexType name='RequestFileStatus'><complexContent><extension base='ns11:FileMetaData'><sequence><element name='state' nillable='true' type='string'/><element name='fileId' type='int'/><element name='TURL' nillable='true' type='string'/><element name='estSecondsToStart' type='int'/><element name='sourceFilename' nillable='true' type='string'/><element name='destFilename' nillable='true' type='string'/><element name='queueOrder' type='int'/></sequence></extension></complexContent></complexType><complexType name='ArrayOfRequestFileStatus'><complexContent><restriction base='soapenc:Array'><attribute ref='soapenc:arrayType' wsdl:arrayType='ns11:RequestFileStatus[]'/></restriction></complexContent></complexType><complexType name='FileMetaData'><sequence><element name='SURL' nillable='true' type='string'/><element name='size' type='long'/><element name='owner' nillable='true' type='string'/><element name='group' nillable='true' type='string'/><element name='permMode' type='int'/><element name='checksumType' nillable='true' type='string'/><element name='checksumValue' nillable='true' type='string'/><element name='isPinned' type='boolean'/><element name='isPermanent' type='boolean'/><element name='isCached' type='boolean'/></sequence></complexType><complexType name='ArrayOfFileMetaData'><complexContent><restriction base='soapenc:Array'><attribute ref='soapenc:arrayType' wsdl:arrayType='ns11:FileMetaData[]'/></restriction></complexContent></complexType></schema><schema xmlns='http://www.w3.org/2001/XMLSchema' targetNamespace='http://www.themindelectric.com/wrappers/'><element name='Integer' nillable='true' type='int'/><element name='Long' nillable='true' type='long'/><element name='Boolean' nillable='true' type='boolean'/></schema><schema xmlns='http://www.w3.org/2001/XMLSchema' targetNamespace='http://www.themindelectric.com/package/java.lang/'><complexType name='ArrayOfstring'><complexContent><restriction base='soapenc:Array'><attribute ref='soapenc:arrayType' wsdl:arrayType='string[]'/></restriction></complexContent></complexType></schema><schema xmlns='http://www.w3.org/2001/XMLSchema' targetNamespace='http://www.themindelectric.com/package/'><complexType name='ArrayOflong'><complexContent><restriction base='soapenc:Array'><attribute ref='soapenc:arrayType' wsdl:arrayType='long[]'/></restriction></complexContent></complexType><complexType name='ArrayOfboolean'><complexContent><restriction base='soapenc:Array'><attribute ref='soapenc:arrayType' wsdl:arrayType='boolean[]'/></restriction></complexContent></complexType></schema></types><message name='put0In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='ns12:ArrayOfstring'/><part name='arg2' type='ns13:ArrayOflong'/><part name='arg3' type='ns13:ArrayOfboolean'/><part name='arg4' type='ns12:ArrayOfstring'/></message><message name='put0Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='get1In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='ns12:ArrayOfstring'/></message><message name='get1Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='copy2In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='ns12:ArrayOfstring'/><part name='arg2' type='ns13:ArrayOfboolean'/></message><message name='copy2Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='ping3In'/><message name='ping3Out'><part name='Result' type='xsd:boolean'/></message><message name='pin4In'><part name='arg0' type='ns12:ArrayOfstring'/></message><message name='pin4Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='unPin5In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='xsd:int'/></message><message name='unPin5Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='setFileStatus6In'><part name='arg0' type='xsd:int'/><part name='arg1' type='xsd:int'/><part name='arg2' type='xsd:string'/></message><message name='setFileStatus6Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='getRequestStatus7In'><part name='arg0' type='xsd:int'/></message><message name='getRequestStatus7Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='getFileMetaData8In'><part name='arg0' type='ns12:ArrayOfstring'/></message><message name='getFileMetaData8Out'><part name='Result' type='ns11:ArrayOfFileMetaData'/></message><message name='mkPermanent9In'><part name='arg0' type='ns12:ArrayOfstring'/></message><message name='mkPermanent9Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='getEstGetTime10In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='ns12:ArrayOfstring'/></message><message name='getEstGetTime10Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='getEstPutTime11In'><part name='arg0' type='ns12:ArrayOfstring'/><part name='arg1' type='ns12:ArrayOfstring'/><part name='arg2' type='ns13:ArrayOflong'/><part name='arg3' type='ns13:ArrayOfboolean'/><part name='arg4' type='ns12:ArrayOfstring'/></message><message name='getEstPutTime11Out'><part name='Result' type='ns11:RequestStatus'/></message><message name='advisoryDelete12In'><part name='arg0' type='ns12:ArrayOfstring'/></message><message name='advisoryDelete12Out'/><message name='getProtocols13In'/><message name='getProtocols13Out'><part name='Result' type='ns12:ArrayOfstring'/></message><portType name='ISRM'><operation name='put' parameterOrder='arg0 arg1 arg2 arg3 arg4'><input name='put0In' message='tns:put0In'/><output name='put0Out' message='tns:put0Out'/></operation><operation name='get' parameterOrder='arg0 arg1'><input name='get1In' message='tns:get1In'/><output name='get1Out' message='tns:get1Out'/></operation><operation name='copy' parameterOrder='arg0 arg1 arg2'><input name='copy2In' message='tns:copy2In'/><output name='copy2Out' message='tns:copy2Out'/></operation><operation name='ping' parameterOrder=''><input name='ping3In' message='tns:ping3In'/><output name='ping3Out' message='tns:ping3Out'/></operation><operation name='pin' parameterOrder='arg0'><input name='pin4In' message='tns:pin4In'/><output name='pin4Out' message='tns:pin4Out'/></operation><operation name='unPin' parameterOrder='arg0 arg1'><input name='unPin5In' message='tns:unPin5In'/><output name='unPin5Out' message='tns:unPin5Out'/></operation><operation name='setFileStatus' parameterOrder='arg0 arg1 arg2'><input name='setFileStatus6In' message='tns:setFileStatus6In'/><output name='setFileStatus6Out' message='tns:setFileStatus6Out'/></operation><operation name='getRequestStatus' parameterOrder='arg0'><input name='getRequestStatus7In' message='tns:getRequestStatus7In'/><output name='getRequestStatus7Out' message='tns:getRequestStatus7Out'/></operation><operation name='getFileMetaData' parameterOrder='arg0'><input name='getFileMetaData8In' message='tns:getFileMetaData8In'/><output name='getFileMetaData8Out' message='tns:getFileMetaData8Out'/></operation><operation name='mkPermanent' parameterOrder='arg0'><input name='mkPermanent9In' message='tns:mkPermanent9In'/><output name='mkPermanent9Out' message='tns:mkPermanent9Out'/></operation><operation name='getEstGetTime' parameterOrder='arg0 arg1'><input name='getEstGetTime10In' message='tns:getEstGetTime10In'/><output name='getEstGetTime10Out' message='tns:getEstGetTime10Out'/></operation><operation name='getEstPutTime' parameterOrder='arg0 arg1 arg2 arg3 arg4'><input name='getEstPutTime11In' message='tns:getEstPutTime11In'/><output name='getEstPutTime11Out' message='tns:getEstPutTime11Out'/></operation><operation name='advisoryDelete' parameterOrder='arg0'><input name='advisoryDelete12In' message='tns:advisoryDelete12In'/><output name='advisoryDelete12Out' message='tns:advisoryDelete12Out'/></operation><operation name='getProtocols' parameterOrder=''><input name='getProtocols13In' message='tns:getProtocols13In'/><output name='getProtocols13Out' message='tns:getProtocols13Out'/></operation></portType><binding name='ISRM' type='tns:ISRM'><soap:binding style='rpc' transport='http://schemas.xmlsoap.org/soap/http'/><operation name='put'><soap:operation soapAction='put' style='rpc'/><input name='put0In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='put0Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='get'><soap:operation soapAction='get' style='rpc'/><input name='get1In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='get1Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='copy'><soap:operation soapAction='copy' style='rpc'/><input name='copy2In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='copy2Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='ping'><soap:operation soapAction='ping' style='rpc'/><input name='ping3In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='ping3Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='pin'><soap:operation soapAction='pin' style='rpc'/><input name='pin4In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='pin4Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='unPin'><soap:operation soapAction='unPin' style='rpc'/><input name='unPin5In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='unPin5Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='setFileStatus'><soap:operation soapAction='setFileStatus' style='rpc'/><input name='setFileStatus6In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='setFileStatus6Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='getRequestStatus'><soap:operation soapAction='getRequestStatus' style='rpc'/><input name='getRequestStatus7In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='getRequestStatus7Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='getFileMetaData'><soap:operation soapAction='getFileMetaData' style='rpc'/><input name='getFileMetaData8In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='getFileMetaData8Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='mkPermanent'><soap:operation soapAction='mkPermanent' style='rpc'/><input name='mkPermanent9In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='mkPermanent9Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='getEstGetTime'><soap:operation soapAction='getEstGetTime' style='rpc'/><input name='getEstGetTime10In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='getEstGetTime10Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='getEstPutTime'><soap:operation soapAction='getEstPutTime' style='rpc'/><input name='getEstPutTime11In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='getEstPutTime11Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='advisoryDelete'><soap:operation soapAction='advisoryDelete' style='rpc'/><input name='advisoryDelete12In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='advisoryDelete12Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation><operation name='getProtocols'><soap:operation soapAction='getProtocols' style='rpc'/><input name='getProtocols13In'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></input><output name='getProtocols13Out'><soap:body use='encoded' namespace='http://tempuri.org/diskCacheV111.srm.server.SRMServerV1' encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'/></output></operation></binding><service name='SRMServerV1'><documentation>diskCacheV111.srm.server.SRMServerV1 web service</documentation><port name='ISRM' binding='tns:ISRM'><soap:address location='https://fndca.fnal.gov:24129/srm/managerv1'/></port></service></definitions>