srmlite/template_srm_getRequestStatus.g2

@@
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:getRequestStatus soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://tempuri.org/diskCacheV111.srm.server.SRMServerV1">
      <arg0 xsi:type="xsd:int">$${requestId}</arg0>
    </ns1:getRequestStatus>
  </soapenv:Body>
</soapenv:Envelope>
@@