srmlite/template_srm_put.g2

@@
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:put soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://tempuri.org/diskCacheV111.srm.server.SRMServerV1">
      <arg0 soapenc:arrayType="xsd:string[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <arg0 xsi:type="xsd:string">$${dstSURL}</arg0>
      </arg0>
      <arg1 soapenc:arrayType="xsd:string[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <arg1 xsi:type="xsd:string">$${dstSURL}</arg1>
      </arg1>
      <arg2 soapenc:arrayType="xsd:long[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <arg2 xsi:type="xsd:long">${size}</arg2>
      </arg2>
      <arg3 soapenc:arrayType="xsd:boolean[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <arg3 xsi:type="xsd:boolean">true</arg3>
      </arg3>
      <arg4 soapenc:arrayType="xsd:string[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <arg4 xsi:type="xsd:string">gsiftp</arg4>
      </arg4>
    </ns1:put>
  </soapenv:Body>
</soapenv:Envelope>
@@